; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 375153 2 2 3 5 2
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	thermograph2 - mode
	infrared1 - mode
	infrared0 - mode
	Star2 - direction
	Star3 - direction
	Star4 - direction
	GroundStation0 - direction
	Star1 - direction
	Star5 - direction
	Planet6 - direction
)
(:init
	(supports instrument0 infrared1)
	(supports instrument0 thermograph2)
	(calibration_target instrument0 GroundStation0)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star5)
	(supports instrument1 thermograph2)
	(supports instrument1 infrared1)
	(supports instrument1 infrared0)
	(calibration_target instrument1 GroundStation0)
	(supports instrument2 infrared1)
	(supports instrument2 thermograph2)
	(calibration_target instrument2 Star1)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star2)
)
(:goal (and
	(pointing satellite0 GroundStation0)
	(pointing satellite1 Star4)
	(have_image Star5 infrared1)
	(have_image Planet6 thermograph2)
))

)

; plan
1. (turn_to satellite1 star4 star2)
   deleted: (pointing satellite1 star2)
   added: (pointing satellite1 star4)
   goals met: 1 of 4
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 1 of 4
3. (turn_to satellite0 groundstation0 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 groundstation0)
   goals met: 2 of 4
4. (calibrate satellite0 instrument0 groundstation0)
   added: (calibrated instrument0)
   goals met: 2 of 4
5. (turn_to satellite1 star5 star4)
   deleted: (pointing satellite1 star4)
   added: (pointing satellite1 star5)
   goals met: 1 of 4
6. (turn_to satellite0 planet6 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 planet6)
   goals met: 0 of 4
7. (turn_to satellite1 star4 star5)
   deleted: (pointing satellite1 star5)
   added: (pointing satellite1 star4)
   goals met: 1 of 4
8. (take_image satellite0 planet6 instrument0 thermograph2)
   added: (have_image planet6 thermograph2)
   goals met: 2 of 4
9. (turn_to satellite0 star5 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 star5)
   goals met: 2 of 4
10. (take_image satellite0 star5 instrument0 infrared1)
   added: (have_image star5 infrared1)
   goals met: 3 of 4
11. (turn_to satellite0 groundstation0 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 groundstation0)
   goals met: 4 of 4
